musicapp/app/controllers/bands_controller.rb

  def create
    @band = Band.new(band_params)

    @band.user_id = current_user.id

    if @band.save
---
INSERT INTO "bands" ("name", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "hello"], ["created_at", "2018-11-16 00:14:33.943229"], ["updated_at", "2018-11-16 00:14:33.943229"], ["user_id", 3]]

  def destroy
    @band = Band.find(params[:id])
    if @band
      @band.destroy
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 1]]